Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: This information is for your reference only and will not be submitted as part of the review. Only the self-reviewer and the manager reviewer can see the content of this panel. The information regarding feedback, feedback requests and behaviors is based on the review period. Content outside this review period, will not be displayed here but is accessible in the relevant locations within the application.
th_th: ข้อมูลนี้มีไว้สำหรับการอ้างอิงเท่านั้น และจะไม่ถูกส่งมาเป็นส่วนหนึ่งของการประเมินผลงาน เฉพาะผู้ประเมินตนเองและหัวหน้างานของผู้ประเมินเท่านั้นที่สามารถดูข้อมูลนี้ได้ ข้อมูลเกี่ยวกับฟีดแบค คำขอฟีดแบค และพฤติกรรมต่างๆ จะอิงตามช่วงเวลาการประเมิน ข้อมูลที่อยู่นอกช่วงเวลาการประเมินจะไม่แสดงที่นี่ แต่สามารถเข้าไปดูได้ในแอปพลิเคชัน

source: Feedback visible to {{name}}
th_th: ฟีดแบคจะมองเห็นได้โดย {{name}}

source: This feedback will be visible to {{name}} when they are completing your review. Consider visiting your feedback page and check if there is any feedback you can share with them that could be relevant to your review. Examine any feedbacks you have attached to your goals and make sure to share those with your manager to make them visible on this page.
th_th: ฟีดแบคเหล่านี้จะปรากฏให้ {{name}} เห็นเมื่อพวกเขาทำการประเมินผลงานคุณ โปรดพิจารณาไปที่หน้าฟีดแบคของคุณและตรวจสอบว่ามีฟีดแบคใด ๆ ที่คุณสามารถแบ่งปันกับพวกเขาได้ซึ่งอาจเกี่ยวข้องกับการประเมินผลงานของคุณ ตรวจสอบฟีดแบคที่คุณแนบไว้กับเป้าหมายของคุณ และอย่าลืมแบ่งปันฟีดแบคเหล่านั้นกับหัวหน้างานของคุณเพื่อให้ฟีดแบคเหล่านั้นปรากฏบนหน้านี้

source: The worker is finalizing their answers to the widget questions. Once the answers are published, you will be able to view them.
th_th: พนักงานกำลังสรุปคำตอบสำหรับคำถามเกี่ยวกับวิดเจ็ต เมื่อคำตอบถูกเผยแพร่แล้ว คุณจะสามารถดูคำตอบเหล่านั้นได้

source: Past reviews
th_th: การประเมินผลงานในอดีต

source: Upcoming review
th_th: การประเมินผลงานที่กำลังจะเกิดขึ้น

source: OK. I will wait for the self-review to be submitted.
th_th: โอเค ฉันจะรอให้ส่งการประเมินตัวเองมา

source: Bold (CTRL+B)
th_th: ตัวหนา (CTRL+B)

source: Bulleted list (CTRL+ALT+O)
th_th: รายการหัวข้อย่อย (CTRL+ALT+O)

source: Emoticon
th_th: อิโมติคอน

source: Italic (CTRL+I)
th_th: ตัวเอียง (CTRL+I)

source: Insert link (CTRL+K)
th_th: แทรกลิงก์ (CTRL+K)

source: Numbered list (CTRL+SHIFT+O)
th_th: ลำดับเลข (CTRL+SHIFT+O)

source: Strikethrough (CTRL+SHIFT+S)
th_th: ขีดทับ (CTRL+SHIFT+S)

source: Styles
th_th: สไตล์

source: Underline (CTRL+U)
th_th: ขีดเส้นใต้ (CTRL+U)

source: Median
th_th: ค่ามัธยฐาน

source: Salary benchmarking
th_th: การเปรียบเทียบเงินเดือน

source: Saving...
th_th: กำลังบันทึก...

source: Type to search
th_th: พิมพ์เพื่อค้นหา

source: Search by person or goal title
th_th: ค้นหาตามบุคคลหรือชื่อเป้าหมาย

source: No elements match your search criteria.
th_th: ไม่มีองค์ประกอบที่ตรงกับเกณฑ์การค้นหาของคุณ

source: Explorer panel
th_th: แผงสำรวจ

source: Primary action bar
th_th: แถบการดำเนินการหลัก

source: Workspace content
th_th: เนื้อหาของพื้นที่ทำงาน

source: Select answer type
th_th: เลือกประเภทคำตอบ

source: --Empty--
th_th: --ว่าง--

source: Add details to the Excel file
th_th: เพิ่มรายละเอียดลงในไฟล์ Excel

source: Upload sensitive content
th_th: อัปโหลดเนื้อหาที่ละเอียดอ่อน

source: Your session will end in {{minutes}} minutes due to inactivity. Click "Continue Session" to stay logged in.
th_th: เซสชันของคุณจะสิ้นสุดในอีก {{minutes}} นาทีเนื่องจากไม่มีการใช้งาน คลิก "ดำเนินการต่อเซสชัน" เพื่อคงการเข้าสู่ระบบ

source: Continue session
th_th: ดำเนินการเซสชันต่อ

source: End session
th_th: สิ้นสุดเซสชัน

source: Account
th_th: บัญชี

source: Application version:
th_th: เวอร์ชันแอพพลิเคชัน:

source: Change password
th_th: เปลี่ยนรหัสผ่าน

source: The new passwords don't match.
th_th: รหัสผ่านใหม่ไม่ตรงกัน

source: Your password was successfully updated; you will be logged out in 3 seconds.
th_th: อัปเดตรหัสผ่านของคุณสำเร็จแล้ว คุณจะออกจากระบบใน 3 วินาที

source: Password mismatch.
th_th: รหัสผ่านไม่ตรงกัน

source: The password you provided is too long.
th_th: รหัสผ่านที่คุณระบุยาวเกินไป

source: The password you provided is too short.
th_th: รหัสผ่านที่คุณระบุสั้นเกินไป

source: All fields must be filled in.
th_th: ต้องกรอกข้อมูลให้ครบทุกฟิลด์

source: Current password
th_th: รหัสผ่านปัจจุบัน

source: New password
th_th: รหัสผ่านใหม่

source: Confirm new password
th_th: ยืนยันรหัสผ่านใหม่

source: No dictionary words
th_th: ไม่มีคำศัพท์ในพจนานุกรม

source: At least one number
th_th: อย่างน้อยหนึ่งหมายเลข

source: At least one lowercase letter
th_th: อย่างน้อยต้องมีตัวอักษรพิมพ์เล็กหนึ่งตัว

source: Maximum length: 23 characters
th_th: ความยาวสูงสุด: 23 อักขระ

source: Minimum length: 4 characters
th_th: ความยาวขั้นต่ำ: 4 อักขระ

source: At least one non-alphanumeric character (!$%@#&^*)
th_th: อักขระที่ไม่ใช่ตัวอักษรและตัวเลขอย่างน้อยหนึ่งตัว (!$ %@ #&^*)

source: Must be different from the 7 previous passwords
th_th: จะต้องไม่ซ้ำกับรหัสผ่าน 7 ครั้งก่อนหน้า

source: Your password must meet the following requirements:
th_th: รหัสผ่านของคุณจะต้องตรงตามข้อกำหนดต่อไปนี้:

source: The username cannot be used in the password
th_th: ชื่อผู้ใช้ไม่สามารถใช้เป็นรหัสผ่านได้

source: At least one uppercase letter
th_th: อย่างน้อยต้องมีตัวอักษรพิมพ์ใหญ่หนึ่งตัว

source: Review consent
th_th: ตรวจสอบความยินยอม

source: You have already accepted our data privacy terms. If you continue, your consent will be withdrawn, and you will be logged out. Are you sure you want to update your consent settings?
th_th: คุณได้ยอมรับข้อกำหนดความเป็นส่วนตัวของข้อมูลของเราแล้ว หากคุณดำเนินการต่อ ความยินยอมของคุณจะถูกถอนออก และคุณจะออกจากระบบ คุณแน่ใจหรือไม่ว่าต้องการอัปเดตการตั้งค่าความยินยอมของคุณ

source: Withdraw consent & logout
th_th: ถอนความยินยอมและออกจากระบบ

source: New data privacy statement
th_th: คำชี้แจงความเป็นส่วนตัวของข้อมูลใหม่

source: Version: {{version}}
th_th: เวอร์ชัน: {{version}}

source: Date display format
th_th: รูปแบบการแสดงวันที่

source: Decimal & thousand separators
th_th: ตัวคั่นทศนิยมและหลักพัน

source: Language & format
th_th: ภาษาและรูปแบบ

source: Format preview
th_th: ดูตัวอย่างรูปแบบ

source: Formatting is linked to the selected language
th_th: รูปแบบการจัดรูปแบบเชื่อมโยงกับภาษาที่เลือก

source: Legal disclaimer
th_th: การปฏิเสธความรับผิดชอบทางกฎหมาย

source: Copyright © {{year}} beqom. All rights reserved. These online services are confidential and proprietary to beqom and for use by authorized beqom customers only.
th_th: ลิขสิทธิ์ © {{year}} beqom สงวนลิขสิทธิ์ บริการออนไลน์เหล่านี้เป็นความลับและเป็นกรรมสิทธิ์ของ beqom และสำหรับลูกค้าที่ได้รับอนุญาตของ beqom เท่านั้นที่จะใช้ได้

source: Search in Settings
th_th: ค้นหาในการตั้งค่า

source: Languages
th_th: ภาษา

source: Switch off to opt out of email notifications. You can opt back in to receive notifications at any time by switching the toggle on.
th_th: ปิดเพื่อปิดการแจ้งเตือนทางอีเมล คุณสามารถเลือกที่จะรับการแจ้งเตือนอีกครั้งได้อีกเมื่อใดก็ได้โดยเปิดการสลับ

source: Receive email notifications
th_th: รับการแจ้งเตือนทางอีเมล

source: Street address
th_th: ที่อยู่ถนน

source: Full street address, which may include the house number, the street name, a P.O. box if any, and multi-line extended street address information.
th_th: ที่อยู่ถนนแบบเต็ม ซึ่งอาจรวมถึงหมายเลขบ้าน ชื่อถนน ตู้ ปณ. หากมี และข้อมูลที่อยู่ถนนแบบขยายหลายบรรทัด

source: Subtitle
th_th: คำบรรยาย

source: Manager budget
th_th: งบประมาณหัวหน้างาน

source: Plan overview
th_th: ภาพรวมแผน

source: Nomination review
th_th: การพิจารณาเสนอชื่อ

source: Expand actions
th_th: ขยายการกระทำ

source: No data to show
th_th: ไม่มีข้อมูลที่จะแสดง

source: No information available at this time.
th_th: ขณะนี้ยังไม่มีข้อมูล

source: Reporting to {{name}}
th_th: รายงานต่อ {{name}}

source: {{days}} days ago
th_th: {{days}} วันที่ผ่านมา

source: Reviewed by {{fullName}}.
th_th: ตรวจสอบโดย {{fullName}}

source: Review outcome
th_th: ผลการประเมินผลงาน

source: You don’t have any check-ins yet. Start by scheduling your first check-in!
th_th: คุณยังไม่มีการเช็คอินเลย เริ่มต้นด้วยการกำหนดเวลาเช็คอินครั้งแรกของคุณ!

source: With the closest deadlines
th_th: ที่มีเวลาครบกำหนดที่ใกล้ที่สุด

source: Tracking
th_th: การติดตาม

source: Open beqom
th_th: เปิด beqom

source: Good afternoon, {{name}}!
th_th: สวัสดีตอนบ่าย {{name}}!

source: Good evening, {{name}}!
th_th: สวัสดีตอนเย็น {{name}}!

source: Good morning, {{name}}!
th_th: สวัสดีตอนเช้า {{name}}!

source: Good night, {{name}}!
th_th: ราตรีสวัสดิ์ {{name}}!

source: With the current rating
th_th: ที่มีการจัดอันดับปัจจุบัน

source: No performance reviews assigned at the moment.
th_th: ไม่มีการมอบหมายการประเมินผลการปฏิบัติงานในขณะนี้

source: Current benefits
th_th: สวัสดิการปัจจุบัน

source: Remaining: {{remaining}}
th_th: คงเหลือ: {{remaining}}

source: Current year bonus
th_th: โบนัสประจำปีปัจจุบัน

source: Target bonus: {{target}}
th_th: โบนัสเป้าหมาย: {{target}}

source: Current year equity/LTI
th_th: หุ้นทุน/สิทธิระยะยาวของปีปัจจุบัน

source: Current share price: {{share}}
th_th: ราคาหุ้นปัจจุบัน: {{share}}

source: Current year salary
th_th: เงินเดือนปีปัจจุบัน

source: {{change}}% change compared to last year
th_th: เปลี่ยนแปลง {{change}}% เมื่อเทียบกับปีที่แล้ว

source: (Default)
th_th: (ค่าเริ่มต้น)

source: Translations: {{translated}}/{{languages}}
th_th: คำแปล: {{translated}}/{{languages}}

source: Disable localization
th_th: ปิดการแปลภาษา

source: Enable localization
th_th: เปิดใช้งานการแปล

source: Hide or display the technical localization keys in the user interface.
th_th: ซ่อนหรือแสดงคีย์โลคัลไลเซชันทางเทคนิคในส่วนติดต่อผู้ใช้

source: Possible values are "Work", "Home" and "Other".'
th_th: ค่าที่เป็นไปได้ ได้แก่ "ที่ทำงาน", "ที่บ้าน" และ "อื่น ๆ"

source: Import/manage users
th_th: นำเข้า/จัดการผู้ใช้

source: Get started by creating or importing
th_th: เริ่มต้นโดยการสร้างหรือการนำเข้า

source: No users assigned to security groups
th_th: ไม่มีผู้ใช้ที่ถูกกำหนดให้กับกลุ่มความปลอดภัย

source: Upload the completed file
th_th: อัปโหลดไฟล์ที่เสร็จสมบูรณ์

source: Supported file formats: CSV Maximum file size: 10MB.
th_th: รูปแบบไฟล์ที่รองรับ: CSV ขนาดไฟล์สูงสุด: 10MB.

source: Import/export
th_th: นำเข้า/ส่งออก

source: by individual
th_th: โดยแต่ละบุคคล

source: by security group
th_th: ตามกลุ่มความปลอดภัย

source: Manage users
th_th: จัดการผู้ใช้

source: Follow the wizard to select users, and then assign them to an existing security group or create a custom security setup.
th_th: ทำตามวิซาร์ดเพื่อเลือกผู้ใช้ จากนั้นกำหนดให้พวกเขาอยู่ในกลุ่มความปลอดภัยที่มีอยู่หรือสร้างการตั้งค่าความปลอดภัยแบบกำหนดเอง

source: Manage users by individuals
th_th: จัดการผู้ใช้เป็นรายบุคคล

source: Follow the guided wizard to manually assign users to an existing security group.
th_th: ทำตามวิซาร์ดแนะนำเพื่อกำหนดผู้ใช้ให้กับกลุ่มความปลอดภัยที่มีอยู่ด้วยตนเอง

source: Manage users by security group
th_th: จัดการผู้ใช้ตามกลุ่มความปลอดภัย

source: Upload a CSV file to create multiple elements in bulk.
th_th: อัปโหลดไฟล์ CSV เพื่อสร้างองค์ประกอบหลายรายการแบบกลุ่ม

source: Import CSV
th_th: นำเข้า CSV

source: Select how you want to manage user security. You can either use the wizard to manually create elements step by step or import a CSV file to upload multiple elements at once.
th_th: เลือกวิธีที่คุณต้องการจัดการความปลอดภัยของผู้ใช้ คุณสามารถใช้ตัวช่วยสร้างเพื่อสร้างองค์ประกอบทีละขั้นตอนด้วยตนเอง หรือจะนำเข้าไฟล์ CSV เพื่ออัปโหลดองค์ประกอบหลายรายการพร้อมกันก็ได้

source: Manage user security
th_th: จัดการความปลอดภัยของผู้ใช้

source: User Security
th_th: ความปลอดภัยของผู้ใช้

source: Security group
th_th: กลุ่มความปลอดภัย

source: Job position
th_th: ตำแหน่งงาน

source: User
th_th: ผู้ใช้

source: Edit group assignment
th_th: แก้ไขการมอบหมายกลุ่ม

source: Email:
th_th: อีเมล:

source: Group name:
th_th: ชื่อกลุ่ม:

source: Job position:
th_th: ตำแหน่งงาน:

source: Roles in group:
th_th: บทบาทในกลุ่ม:

source: Security group details
th_th: รายละเอียดกลุ่มความปลอดภัย

source: User details
th_th: รายละเอียดผู้ใช้

source: User:
th_th: ผู้ใช้:

source: Work country:
th_th: ประเทศที่ทำงาน:

source: User roles & permissions
th_th: บทบาทและสิทธิ์ของผู้ใช้

source: View feedback
th_th: ดูฟีดแบค

source: After performing this action, further edits will no longer be possible.
th_th: หลังจากดำเนินการนี้แล้ว จะไม่สามารถแก้ไขเพิ่มเติมได้อีก

source: Mark the goal as done to complete it.
th_th: ทำเครื่องหมายว่าเป้าหมายเสร็จสิ้นเพื่อให้เสร็จสมบูรณ์

source: Status update
th_th: อัปเดตสถานะ

source: My goal
th_th: เป้าหมายของฉัน

source: View tags
th_th: ดูแท็ก

source: Watermark text
th_th: ข้อความลายน้ำ

source: Complete setup
th_th: ตั้งค่าจนเสร็จสมบูรณ์

source: To make sure you get the best experience on the platform, please select the information and apply it in the field below. You can update your preferences at any time in the user settings.
th_th: เพื่อให้คุณได้รับประสบการณ์ที่ดีที่สุดบนแพลตฟอร์ม โปรดเลือกข้อมูลและนำไปใช้ในช่องด้านล่าง คุณสามารถอัปเดตการตั้งค่าที่ต้องการได้ตลอดเวลาในส่วนการตั้งค่าผู้ใช้

source: Go to my equity page
th_th: ไปที่หน้าหุ้นของฉัน

source: My total grands
th_th: ยอดรวมทั้งหมดของฉัน

source: Total grants
th_th: จำนวนเงินช่วยเหลือทั้งหมด

source: Compensation equity
th_th: ความเท่าเทียมในการชดเชย

source: <0>{{value}}</0> of {{total}}
th_th: <0>{{value}}</0> จาก {{total}}

source: Privacy mode on
th_th: โหมดความเป็นส่วนตัวเปิดอยู่

source: Activate our powerful analytics framework for in-depth data analysis, data visualization, and business/operational insights. Users need the "Analytics" professional role to access these dashboards.
th_th: เปิดใช้งานกรอบการวิเคราะห์ข้อมูลอันทรงพลังของเราเพื่อการวิเคราะห์ข้อมูลเชิงลึก การแสดงผลข้อมูล และการให้ข้อมูลเชิงลึกทางธุรกิจ/การดำเนินงาน ผู้ใช้จำเป็นต้องมีบทบาทมืออาชีพ "Analytics" เพื่อเข้าถึงแดชบอร์ดเหล่านี้

source: Enable Analytics Hub
th_th: เปิดใช้งาน Analytics Hub

source: Any worker having at least one direct report will have access to the Analytics Hub where they will be able to view dashboards for all the workers within their reporting line (direct and indirect). The reporting line is defined by the line manager relationship defined in the data foundation Employment entity.
th_th: พนักงานคนใดก็ตามที่มีผู้ใต้บังคับบัญชาอย่างน้อยหนึ่งคนจะสามารถเข้าถึง Analytics Hub ได้ ซึ่งจะสามารถดูแดชบอร์ดของพนักงานทุกคนในสายการรายงานของตนเอง (ทั้งทางตรงและทางอ้อม) โดยสายการรายงานนี้จะถูกกำหนดโดยความสัมพันธ์ของผู้จัดการสายงานที่ระบุไว้ในข้อมูลพื้นฐานของหน่วยงานการจ้างงาน

source: Manager access
th_th: การเข้าถึงของผู้จัดการ

source: Analytics Hub Settings
th_th: การตั้งค่า Analytics Hub

source: Analytics Settings
th_th: การตั้งค่าการวิเคราะห์

source: This modification will impact all users.
th_th: การแก้ไขนี้จะมีผลกระทบต่อผู้ใช้ทุกคน

source: This bonus plan ({{bonusPlanName}}) is currently used in the following compensation rounds:
th_th: แผนโบนัสนี้ ({{bonusPlanName}}) กำลังถูกใช้ในรอบการชดเชยต่อไปนี้:

source: This bonus plan is in "Draft" status and is not used in any compensation rounds. Deleting it will permanently remove it from the list.
th_th: แผนโบนัสนี้อยู่ในสถานะ "ฉบับร่าง" และยังไม่ได้ใช้ในรอบการจ่ายค่าตอบแทนใดๆ การลบจะเป็นการลบออกจากรายการอย่างถาวร

source: Are you sure you want to delete the pending draft of this bonus plan?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบแบบร่างที่รอดำเนินการของแผนโบนัสนี้?

source: You do not have permission to delete this bonus plan. Only users with the Global Compensation Admin role can perform this action.
th_th: คุณไม่มีสิทธิ์ลบแผนโบนัสนี้ มีเพียงผู้ใช้ที่มีบทบาทผู้ดูแลระบบค่าตอบแทนส่วนกลาง (Global Compensation Admin) เท่านั้นที่สามารถดำเนินการนี้ได้

source: This bonus plan is currently used in the following compensation rounds. To delete it, please replace it another bonus plan in "Ready" status.
th_th: แผนโบนัสนี้กำลังถูกใช้งานอยู่ในรอบการจ่ายค่าตอบแทนต่อไปนี้ หากต้องการลบ โปรดแทนที่ด้วยแผนโบนัสอื่นที่มีสถานะ "พร้อมใช้งาน"

source: Compensation rounds using this bonus plan:
th_th: รอบการชดเชยที่ใช้แผนโบนัสนี้:

source: This bonus plan is in "Ready" status and is not used in any compensation rounds. Deleting it will permanently remove it from the list.
th_th: แผนโบนัสนี้อยู่ในสถานะ "พร้อมใช้งาน" และไม่ได้ถูกใช้ในรอบการชดเชยใด ๆ การลบจะเป็นการนำออกจากรายการอย่างถาวร

source: Replace bonus plan before deletion
th_th: แทนที่แผนโบนัสก่อนลบ

source: Delete bonus plan
th_th: ลบแผนโบนัส

source: The bonus plan was successfully deleted.
th_th: ลบแผนโบนัสเรียบร้อยแล้ว

source: No bonus plans have been created yet
th_th: ยังไม่มีการสร้างแผนโบนัส

source: No bonus plans
th_th: ไม่มีแผนโบนัส

source: The plan is about a deactivated user.
th_th: แผนนี้เกี่ยวกับผู้ใช้ที่ถูกปิดการใช้งานแล้ว

source: Plan stage
th_th: ขั้นตอนการวางแผน

source: View plan
th_th: ดูแผน

source: Current plan stage: {{stageName}}
th_th: สถานะขั้นตอนแผนปัจจุบัน: {{stageName}}

source: Delete plan
th_th: ลบแผน

source: Delete plans
th_th: ลบแผน

source: Are you sure you want to delete {{count}} career development plan?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบแผนพัฒนาสายอาชีพ {{count}} ?

source: Are you sure you want to delete {{count}} career development plans?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบแผนพัฒนาสายอาชีพ {{count}} รายการนี้?

source: This action cannot be undone.
th_th: ไม่สามารถยกเลิกการดำเนินการนี้ได้

source: Delete {{count}} career development plan
th_th: ลบแผนพัฒนาสายอาชีพ {{count}}

source: Delete {{count}} career development plans
th_th: ลบแผนพัฒนาสายอาชีพ {{count}} รายการ

source: {{count}} career development plan was successfully deleted.
th_th: ลบแผนพัฒนาสายอาชีพ {{count}} รายการเรียบร้อยแล้ว

source: {{count}} career development plans were successfully deleted.
th_th: ลบแผนพัฒนาสายอาชีพ {{count}} รายการเรียบร้อยแล้ว

source: {{count}} out of {{chosenPlans}} career development plans was successfully deleted.
th_th: ลบแผนการพัฒนาสายอาชีพ {{count}} แผน จากทั้งหมด {{chosenPlans}} แผนเรียบร้อยแล้ว

source: {{count}} out of {{chosenPlans}} career development plans were successfully deleted.
th_th: ลบแผนพัฒนาสายอาชีพ {{count}} จาก {{chosenPlans}} แผนสำเร็จแล้ว

source: The list can load up to {{count}} results. Use search to find additional managers.
th_th: รายการนี้สามารถโหลดได้สูงสุด {{count}} รายการ โปรดใช้การค้นหาเพื่อค้นหาผู้จัดการเพิ่มเติม

source: The list can load up to {{count}} results. Use search to find additional organizational units.
th_th: รายการสามารถโหลดผลลัพธ์ได้สูงสุด {{count}} รายการ ใช้การค้นหาเพื่อค้นหาหน่วยองค์กรเพิ่มเติม

source: Filter by plan stage
th_th: กรองตามขั้นตอนของแผน

source: Select a plan stage
th_th: เลือกขั้นตอนของแผน

source: The list can load up to {{count}} results. Use search to find additional workers.
th_th: รายการสามารถโหลดผลลัพธ์ได้สูงสุด {{count}} รายการ ใช้การค้นหาเพื่อหาคนทำงานเพิ่มเติม

source: To move plans to a different stage, select the plan stage and then filter to find specific plans in the selected stage.
th_th: เมื่อต้องการย้ายแผนไปยังสถานะอื่น ให้เลือกสถานะของแผน และใช้ตัวกรองเพื่อค้นหาแผนเฉพาะในสถานะที่เลือกนั้น

source: View all or apply filters to see plans and available actions
th_th: ดูทั้งหมดหรือใช้ตัวกรองเพื่อดูแผนและการดำเนินการที่มีให้เลือก

source: There are {{count}} career development plans
th_th: มีแผนการพัฒนาสายอาชีพ {{count}} ฉบับ

source: Move career development plans
th_th: ย้ายแผนพัฒนาสายอาชีพ

source: Move career plans
th_th: ย้ายแผนอาชีพ

source: Managers will need to review and submit their inputs again. This action cannot be undone.
th_th: ผู้จัดการจะต้องตรวจสอบและส่งข้อมูลของตนอีกครั้ง การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Workers and managers will need to submit their inputs again according to the workflow. This action cannot be undone.
th_th: พนักงานและผู้จัดการจะต้องส่งข้อมูลของตนอีกครั้งตามลำดับขั้นตอนของเวิร์กโฟลว์ การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Workers will need to submit their inputs again according to the workflow. This action cannot be undone.
th_th: พนักงานจะต้องส่งข้อมูลของตนอีกครั้งตามลำดับขั้นของเวิร์กโฟลว์ การดำเนินการนี้ไม่สามารถยกเลิกได้

source: You are about to move the career development plan from the "<0>{{fromStatus}}</0>" stage to the "<1>{{toStatus}}</1>" stage.
th_th: คุณกำลังจะย้ายแผนพัฒนาสายอาชีพจากขั้นตอน "<0>{{fromStatus}}</0>" ไปยังขั้นตอน "<1>{{toStatus}}</1>"

source: Move career plans to a different stage
th_th: ย้ายแผนพัฒนาอาชีพไปยังขั้นตอนอื่น

source: Select plans to continue
th_th: เลือกแผนเพื่อดำเนินการต่อ

source: {{count}} career development plan was successfully moved to the selected stage.
th_th: {{count}} แผนพัฒนาสายอาชีพถูกย้ายไปยังขั้นตอนที่เลือกเรียบร้อยแล้ว

source: {{count}} career development plans were successfully moved to the selected stage.
th_th: {{count}} แผนพัฒนาสายอาชีพถูกย้ายไปยังขั้นตอนที่เลือกเรียบร้อยแล้ว

source: {{count}} out of {{requestedPlansCount}} career development plans were successfully moved to the selected stage.
th_th: {{count}} จาก {{requestedPlansCount}} แผนพัฒนาสายอาชีพถูกย้ายไปยังขั้นตอนที่เลือกเรียบร้อยแล้ว

source: Apply filters to view the plans and move them to the next stage.
th_th: ใช้ตัวกรองเพื่อดูแผนต่างๆ และย้ายแผนไปยังขั้นตอนถัดไป

source: There are {{count}} plans in "{{planStage}}" stage
th_th: มี {{count}} แผนในขั้นตอน "{{planStage}}"

source: Adjust your filters to find what you are looking for.
th_th: ปรับตัวกรองของคุณเพื่อค้นหาสิ่งที่คุณกำลังมองหา

source: No plans found
th_th: ไม่พบแผน

source: Manage {{planName}}
th_th: จัดการ {{planName}}

source: Plans in "{{planStage}}" stage: {{count}}
th_th: แผนในขั้นตอน "{{planStage}}": {{count}}

source: Search result: {{count}}
th_th: ผลการค้นหา: {{count}}

source: Career development plans that are in the closed stage cannot be deleted.
th_th: ไม่สามารถลบแผนพัฒนาสายอาชีพที่อยู่ในสถานะปิดได้

source: Manage plans
th_th: จัดการแผน

source: New plan stage
th_th: ขั้นตอนแผนใหม่

source: Choose the plan stage
th_th: เลือกขั้นตอนแผน

source: Career Development Plans
th_th: แผนพัฒนาอาชีพ

source: The population of the career development plan will be based on the local admin's access. They will be able to edit only the population within the template.
th_th: จำนวนประชากรในแผนพัฒนาวิชาชีพจะขึ้นอยู่กับการเข้าถึงของผู้ดูแลระบบท้องถิ่น พวกเขาจะสามารถแก้ไขได้เฉพาะจำนวนประชากรภายในแม่แบบเท่านั้น

source: Allow local admins in career development plan templates
th_th: อนุญาตให้ผู้ดูแลระบบท้องถิ่นในแม่แบบแผนพัฒนาทางอาชีพ

source: The reassigned reviewer will see the reassigned process in their list and will be able to complete the manager’s part. The reassigned reviewer will see all worker-related data (goals, skills, etc.) visible in the career development process, the same way as the line manager would. Please note that reassignment implies that the reassigned reviewer will complete the full process with the worker.
th_th: ผู้ทบทวนที่ได้รับมอบหมายใหม่จะเห็นกระบวนการที่ถูกมอบหมายให้ใหม่ในรายการของตน และจะสามารถทำส่วนของผู้จัดการให้เสร็จสมบูรณ์ได้ ผู้ทบทวนที่ได้รับมอบหมายใหม่จะเห็นข้อมูลที่เกี่ยวข้องกับพนักงานทั้งหมด (เป้าหมาย ทักษะ ฯลฯ) ที่มองเห็นได้ในกระบวนการพัฒนาสายอาชีพ ในลักษณะเดียวกับที่ผู้จัดการสายงานเห็น โปรดทราบว่าการมอบหมายใหม่หมายความว่าผู้ทบทวนที่ได้รับมอบหมายใหม่จะต้องดำเนินกระบวนการทั้งหมดร่วมกับพนักงานให้เสร็จสมบูรณ์

source: Allow line managers to reassign career development plans to other users
th_th: อนุญาตให้ผู้จัดการสายงานมอบหมายแผนพัฒนาสายอาชีพให้ผู้ใช้งานรายอื่นได้อีกครั้ง

source: Closed career development plans done with a worker's previous manager will be made visible to their new manager. The previous manager will still be able to see the career development plans after transfer.
th_th: แผนพัฒนาสายอาชีพที่ปิดแล้วซึ่งจัดทำร่วมกับผู้จัดการคนก่อนของพนักงานจะถูกแสดงให้ผู้จัดการคนใหม่เห็นด้วย โดยผู้จัดการคนก่อนจะยังคงสามารถดูแผนพัฒนาสายอาชีพเหล่านั้นได้หลังจากมีการโอนย้ายพนักงานแล้ว

source: Allow system managers to see closed career development plans
th_th: อนุญาตให้ผู้จัดการระบบสามารถดูแผนพัฒนาสายอาชีพที่ปิดแล้วได้
